{
  "Major-projects": [
    {
      "name": "PreserVita iOS",
      "desc": "Originally an idea of my father's, I began this app in Android to help solve an issue of data collection and data visualization for his department, Infection & Control, at work. However, as I worked out the details with him, it became more apparent how helpful this app could be for not only his own hospital but for hospitals and clinics in general. In his experience, hospitals often lag behind in terms of technology, despite the huge benefit data collection often brings.",
      "images": [
        {
          "src": "https://i.imgur.com/N2UszlP.png",
          "alt": "Home screen with several buttons to point users to various data points"
        },
        {
          "src": "https://images.techhive.com/images/article/2013/11/kitkat_applauncher-100067516-orig.png",
          "alt": "Home screen displaying "
        }
      ],
      "github": "https://github.com/NLCaceres/iOS-Records"
    },
    {
      "name": "Work-it iOS",
      "desc": "One of my first major iOS projects. The idea came from conversations with my best friend about an all encompassing fitness and health app. There are plenty of apps that cover nutrition, and plenty that cover exercise, but we wanted an app that would fit it all in one clean space. Using this project for my first iOS class, the undertaking was far too much to manage in a month, but I found this realization helped me for future projects by teaching me better project management and setting realistic goals. ",
      "images": [
        {
          "src": "https://images.techhive.com/images/article/2013/11/kitkat_applauncher-100067516-orig.png",
          "alt": "Home screen displaying "
        }
      ],
      "github": "https://github.com/NLCaceres/WorkIt-iOS"
    }
  ],
  "Small-projects": [
    {
      "name": "Playing with UI-Kit iOS",
      "desc": "The remaining apps showcase my simple attempts in several iOS focused classes to incorporate various libraries from Apple and Facebook. In this particular example, we were instructed to create a small app that would create balls to bounce across the screen, interacting with each other thanks to UI-Kit and the simple physics it provides",
      "images": [
        {
          "src": "./beach.jpeg",
          "alt": "Home screen with a simple button to make more circles (balls) that will float and bounce around the screen."
        }
      ],
      "github": "github-url"
    },
    {
      "name": "Keeping data secured ...as long as the bugs don't leak them. iOS",
      "desc": "This was one of my last projects that used Objective-C, and would have been a fun example of keychain, using internal passwords or fingerprints securely. Unfortunately, keychain was horribly bugged at the time and required at least a few workarounds to get it to properly work. After searching tirelessly to find some way to make keychain work as intended and expected based on Apple's documents, I found several suggestions on StackOverflow and various sites online on what to change to enable keychain. Thankfully the workaround I found temporarily fixed keychain for me and finally a user could write notes that were secure from any prying eyes.",
      "images": [
        {
          "src": "./beach.jpeg",
          "alt": "Home screen displaying a login screen and asking to gather a password from the user to login to see a series of user-specific notes"
        }
      ],
      "github": "github-url"
    },
    {
      "name": "Keeping things flowing with background downloading iOS",
      "desc": "This project was built to not only to practice working with a REST API asynchronously, but also to see how tableViews could be further customized, loading each object in series. Using Grand Central Dispatch to create queues and handle threads, the project would make GET requests, parse the response, and slide each object as a cell into the table.",
      "images": [
        {
          "src": "./beach.jpeg",
          "alt": "Home screen displaying"
        }
      ],
      "github": "github-url"
    },
    {
      "name": "Remembering my contacts with help from CoreData iOS",
      "desc": "In this app, I took my first steps in learning Swift. Incorporating Apple's CoreData for data persistance, a user could save contacts locally, keeping things simple without a database.",
      "images": [
        {
          "src": "./beach.jpeg",
          "alt": "Home screen displaying a table view of the contacts contained and saved within the app."
        }
      ],
      "github": "github-url"
    },
    {
      "name": "Playing with the Facebook SDK iOS",
      "desc": "With this particular mini-app, we were given free reign to incorporate a 3rd-party library, so I chose Facebook given its popularity at the time. Keeping things simple, I wanted to incorporate the Facebook SDK to allow users to log into the app, gaining the ability for friends to be see to each other.",
      "images": [
        {
          "src": "./beach.jpeg",
          "alt": "Home screen displaying the login. Once logged in, login-screen will no longer be seen until log-out."
        }
      ],
      "github": "github-url"
    }
  ]
}
